cases/chpt4-tin-solid-507-ray/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.Phase1 0
    volScalarFieldValue alpha.Phase2 1
    volScalarFieldValue alpha.Phase3 0
);

regions
(
/*    boxToCell
    {
        box (0 -0.02 0) (0.0025 0.02 6.35);
        fieldValues
        (
            volScalarFieldValue alpha.Phase1 1
        );
    }*/
);


// ************************************************************************* //
